src/Catalogs/АлгоритмыПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>АлгоритмыПроцессов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщениеПриНевыполнении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Условие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛокальныеИменованныеКонстанты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/АлгоритмыПроцессов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура УсловиеПриИзменении(Элемент)
	НастроитьЭлементыФормы();
КонецПроцедуры


&НаКлиенте
Процедура НастроитьЭлементыФормы()
	
	Элементы.ГруппаСообщениеПриНевыполнении.Видимость = Объект.Условие;
	Элементы.ДекорацияПодсказка.Заголовок = ТекстПодсказки();
	
КонецПроцедуры

&НаКлиенте
Функция ТекстПодсказки()
	
	ТекстПодсказки = "Для алгоритмов выполняющихся на сервере доступен объект документа Акт рассмотрения возврата (""ДокументОбъект"").
	|
	|Для алгоритмов, выполняющихся на клиенте доступна форма документа (""пФорма"").
	|	
	|Локальные именованные константы доступны с помощью обращения лИК[""ИмяКонстанты""]
	|	
	|Именованные константы процесса доступны с помощью обращения ИК[""ИмяКонстанты""]
	|
	|Для условия должно быть установлено значение переменной ""Результат""
	|
	|Если условие не выполнено, пояснение можно поместить в переменную ""СообщениеПриНевыполнении"", либо задать на отдельной вкладке
	|
	|Дополнительный комментарий о результате выполнения можно поместить в переменную ""ДопТекстСобытия""
	|
	|Чтобы не записывать комментарий о результате выполнения команды, необходимо установить значение переменной	НеФиксироватьСобытиеВыполненияКоманды = Истина;
	|";
	
	Возврат ТекстПодсказки;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьЭлементыФормы();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользованиеВКомандах.Параметры.УстановитьЗначениеПараметра("Алгоритм", Объект.Ссылка);
	ИспользованиеВоВзаимосвязях.Параметры.УстановитьЗначениеПараметра("Алгоритм", Объект.Ссылка);
	ИспользованиеВСтатусах.Параметры.УстановитьЗначениеПараметра("Алгоритм", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеВКомандахВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элемент.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеВоВзаимосвязяхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элемент.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеВСтатусахВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элемент.ТекущиеДанные.Ссылка);
КонецПроцедуры
